# User profile data

In [62]:
import pandas as pd

In [2]:
from sklearn.cluster import KMeans

In [3]:
plays_data = pd.read_csv('C:/Users/Charan/Downloads/usersha1-artmbid-artname-plays.tsv',sep='\t')

In [4]:
plays_data.head()

   u1  a1  name1  100
0  u2  a2  name2  200
1  u3  a3  name3  150
2  u4  a4  name4  300
3  u5  a5  name5  100
4  u6  a6  name6  200

In [5]:
plays_data.columns=['user_id','artist_id','artist_name','plays']

In [6]:
plays_data.describe()

             plays
count    99.000000
mean    650.505051
std     286.774368
min     100.000000
25%     405.000000
50%     650.000000
75%     895.000000
max    1140.000000

In [7]:
plays_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   user_id      99 non-null     object
 1   artist_id    99 non-null     object
 2   artist_name  99 non-null     object
 3   plays        99 non-null     int64
dtypes: int64(1), object(3)
memory usage: 3.2+ KB

In [8]:
plays_data.shape

(99, 4)

In [9]:
plays_data['plays'].max()

1140

In [10]:
plays_data.columns

Index(['user_id', 'artist_id', 'artist_name', 'plays'], dtype='object')

In [13]:
plays_data['user_id'].nunique()

99

In [14]:
plays_data.drop('artist_name',axis=1, inplace=True)

In [15]:
plays_data.head()

  user_id artist_id  plays
0      u2        a2    200
1      u3        a3    150
2      u4        a4    300
3      u5        a5    100
4      u6        a6    200

In [17]:
artist_data = plays_data[['artist_id','plays']]

In [18]:
artist_data.head()

  artist_id  plays
0        a2    200
1        a3    150
2        a4    300
3        a5    100
4        a6    200

In [19]:
artist_aggr = artist_data.groupby('artist_id', as_index=False).sum()

In [20]:
artist_aggr.head()

  artist_id  plays
0       a10    240
1      a100   1140
2       a11    250
3       a12    260
4       a13    270

In [21]:
artist_data.shape

(99, 2)

In [22]:
artist_aggr.shape

(99, 2)

In [23]:
artist_aggr.columns

Index(['artist_id', 'plays'], dtype='object')

# Clustering on artist data

In [37]:
import sklearn

In [38]:
from sklearn.cluster import KMeans

In [39]:
km1 = sklearn.cluster.KMeans(n_clusters=10)

In [40]:
artist_count = artist_aggr[['plays']]

In [41]:
artist_count.head()

   plays
0    240
1   1140
2    250
3    260
4    270

In [42]:
km1.fit(artist_count)

KMeans(n_clusters=10)

In [43]:
label1 = km1.labels_

In [44]:
artist_aggr['cluster_id'] = label1

In [48]:
artist_aggr[artist_aggr['cluster_id']==7]

   artist_id  plays  cluster_id
54       a59    730           7
56       a60    740           7
57       a61    750           7
58       a62    760           7
59       a63    770           7
60       a64    780           7
61       a65    790           7
62       a66    800           7
63       a67    810           7
64       a68    820           7

# user data (how many time songs played by a user)

In [49]:
user_data = plays_data[['user_id','plays']]

In [50]:
user_data.head()

  user_id  plays
0      u2    200
1      u3    150
2      u4    300
3      u5    100
4      u6    200

In [51]:
user_aggr = user_data.groupby('user_id', as_index=False).sum()

In [52]:
user_aggr.head()

  user_id  plays
0     u10    240
1    u100   1140
2     u11    250
3     u12    260
4     u13    270

In [53]:
user_aggr.shape

(99, 2)

# clustering on user data(similar users)

In [54]:
user_count = user_aggr[['plays']]

In [55]:
user_count.head()

   plays
0    240
1   1140
2    250
3    260
4    270

In [56]:
km2 = sklearn.cluster.KMeans(n_clusters=10)

In [57]:
km2.fit(user_count)

KMeans(n_clusters=10)

In [58]:
label2 = km2.labels_

In [59]:
label2

array([6, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 6, 3, 3, 8, 8, 8, 8, 8, 8, 8, 8,
       6, 8, 8, 8, 1, 1, 1, 1, 1, 1, 1, 3, 1, 1, 1, 5, 5, 5, 5, 5, 5, 5,
       6, 5, 5, 5, 9, 9, 9, 9, 9, 9, 9, 6, 9, 9, 9, 0, 0, 0, 0, 0, 0, 0,
       6, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 6, 4, 7, 7, 7, 7, 7, 7, 7, 7, 7,
       6, 7, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [60]:
user_aggr['cluster_id'] = label2

In [61]:
user_aggr[user_aggr['cluster_id']==8]

   user_id  plays  cluster_id
14     u22    360           8
15     u23    370           8
16     u24    380           8
17     u25    390           8
18     u26    400           8
19     u27    410           8
20     u28    420           8
21     u29    430           8
23     u30    440           8
24     u31    450           8
25     u32    460           8